[{"title": "Software Developer", "location": "Aberdeen", "description": "Excellent communication skills; able to interact with people at all levels within the business  Keen to participate in requirements gathering, product demonstrations and pre-sales technical support.  Can quickly adapt to customer environments and ways of working when onsite.  Works well on their own or as part of a team, including virtual team-working using Skype.  Great communicator and can explain concepts clearly in both technical and non-technical language depending on the audience.  Enthusiastic about using technology to make a difference and able to help lead innovative thinking.  NET Web Forms & MVC applications design & development using .NET  Demonstrable SQL/Database skills and experience  Visual Studio (2015, 2017), TFS and/or Visual Studio Online (GIT based repositories)  Demonstrable UX / UI design (including wire-framing, HTML/CSS/Javascript)  "}, {"title": "SharePoint Developer", "location": "Aberdeen", "description": "You'll get an opportunity to work alongside talented individuals who are passionate about software development  You will join an existing team developing solutions across a variety of platforms.  You'll be given the opportunity to work on challenging projects that allow you to keep your skill-set at the forefront of developments in technology.  Building and configuring SharePoint websites and developing code for SharePoint, while maintaining SharePoint environment performance, capability and availability.  Assisting in project development, defining technical requirements and developing solutions; on-going support for applications; designing and customizing SharePoint solutions; and contributing to architectural design.  Effective content and source-code management, planning and implementing software version upgrade releases; troubleshooting and debugging SharePoint sites; and working as a consultant on SharePoint customisation projects.  "}, {"title": "Software Developer Junior", "location": "Aberdeen", "description": "\nSoftware Developer Junior jobs in Aberdeen\n  \nJobs at MCRK Recruitment in Aberdeen\n  "}, {"title": "Software Developer", "location": "Aberdeen AB10", "description": "\nSoftware Developer jobs in Aberdeen AB10\n  \nJobs at TR PT Endusers in Aberdeen AB10\n  "}, {"title": "Junior Software Developer", "location": "Aberdeen", "description": "HTML5  CSS3  Object Oriented Programming  Java SE 8  Participate in creative sessions and offer ideas from a software standpoint  Deliver your tasks with precision  Be comfortable working on multiple projects  Analyse code for errors or inconsistencies  Problem solve and offer solutions  \nJunior Software Developer jobs in Aberdeen\n  \nJobs at SoftwareDev in Aberdeen\n  "}, {"title": "Junior - Mid level Winforms/ WPF developer", "location": "Aberdeen", "description": "\nJunior jobs in Aberdeen\n  \nJobs at Experis in Aberdeen\n  "}, {"title": "Oracle PL/SQL Developer (Programmer, PL/SQL, SQL Server)", "location": "Aberdeen", "description": "\nOracle PL SQL Developer jobs in Aberdeen\n  \nJobs at Head Resourcing in Aberdeen\n  "}, {"title": "ERP Functional Consultant GBP45k-70k plus package", "location": "Aberdeen", "description": ""}, {"title": "Fully remote - Senior .NET developer", "location": "Aberdeen", "description": ""}, {"title": "Application Services Analyst - .NET Developer", "location": "Aberdeen AB12", "description": "\nApplication Service Analyst jobs in Aberdeen AB12\n  \nJobs at AS EAAA in Aberdeen AB12\n  "}, {"title": "Application Services Analyst - .NET Developer", "location": "Aberdeen AB12", "description": "Delivery and support of IT solutions on a global basis. · Worked as part of a development and support team. · Experience of working with Continual Integration/Continual Delivery. · Experience of automating development practices.  Experience of working with Microsoft Azure. · Experience of working using the SCRUM framework. Additional Details The Company embraces diversity in our workforce, ensuring we have a workforce that provides us with a wide range of skills, ideas and energy. Embracing diversity means the Company will acknowledge, understand and appreciate the differences between individuals in developing a workplace that develops, benefits and enhances their value.  \nApplication Service Analyst jobs in Aberdeen AB12\n  \nJobs at Wood Group in Aberdeen AB12\n  "}, {"title": "Application Services Analyst - Visual Basic Developer", "location": "Aberdeen AB12", "description": "\nApplication Service Analyst jobs in Aberdeen AB12\n  \nJobs at AS EAAA in Aberdeen AB12\n  "}, {"title": "Application Services Analyst - Visual Basic Developer", "location": "Aberdeen AB12", "description": "Worked as part of a development and support team. · Experience of working with Continual Integration/Continual Delivery. · Experience of automating development practices. · Experience of working with Microsoft Azure.  \nApplication Service Analyst jobs in Aberdeen AB12\n  \nJobs at Wood Group in Aberdeen AB12\n  "}, {"title": "Business Performance, Reporting & Database Developer", "location": "Aberdeen AB12", "description": "Design, maintain, support, and enhance business intelligence and reporting including the data backend.  Engage with the organisation and recommend / deliver modern, best-practice business intelligence and reporting solutions.  Maximise the benefit of existing systems and lead the transition from legacy to current technologies.  Work collaboratively in a cross-functional team which proactively drives innovation, business growth and use of systems through technology.  Contribute to the overall governance, maintenance and development of the ERP system.  Perform core database management and reporting frequency-based activities.  Design and implement a modern and scalable data warehouse, OLAP-based reporting and BI (SSRS / PowerBI).  Work with end users ensuring data and reports meet their business needs.  Lead the design and implementation of reporting and database systems.  Design and monitor end-user reporting tools and systems, ensuring reports are accurate and up-to-date.  Liaise with stakeholders to understand organisation structure, policies and operations, recommending reporting solutions which enable the organisation to achieve its goals.  Responsibility and accountable for day to day database processes and administration (invoices, MRP, overnight processing).  Contribution to ERP systems administration including month-end processing and reporting.  Contribution to general IT support.  Degree in suitable IT discipline  Expert with MS SQL Server database technologies.  Delivery of database and BI solutions in an ERP environment.  Design, development and maintenance of datawarehouses and business reporting solutions.  Track record of proactively applying expertise and driving strategic business change.  Ability to balance responding to business needs with technical authority / best practice.  Microsoft SQL Server database development & administration (SSAS, SSIS, SSRS, SSMS, SQL Server, Agent Jobs, maintenance, backup, performance tuning, DAX, DTS).  T-SQL (Complex query design, views, functions, stored procedures).  Designing OLAP-based reporting solution including the development / maintenance of cubes.  Excel / MS-Query / VBA development.  Excellent communication skills at all levels of the business.  Proactive & tactful negotiator / influencer at all levels.  Ability to work within cross-functional and self-organising teams.  Coding best-practice and source / version control with proven ability to own this across responsible area.  Masters Degree in suitable IT discipline.  Certification in relevant IT areas.  Experience of manufacturing, distribution and sales IT.  Background in software development.  Exposure to latest SQL Server e.g. 2017.  Working in a DevOps team.  Kanban / Agile Methodology.  C# .NET software development.  ERP development / integration.  Support, maintenance and development for ERP.  Power BI development.  Business analysis / process design.  Project management.  Visual Studio  GIT  Database and BI solutions in an ERP environment: 4 years  Designing OLAP-based reporting solutions: 3 years  MS SQL: 5 years  Design, development and maintenance of datawarehouses: 3 years  Excel / MS-Query / VBA development.: 4 years  Bachelor's  Aberdeen AB12  "}, {"title": "Dynamics AX Solution Architect - GBP100K + Benefits", "location": "Aberdeen", "description": "The chance to work on the most exciting and innovative AX365 projects in the UK.  The opportunity to gain experience with the latest version of AX.  A position within a market leading company which is investing upwards of $2 billion in the Dynamics platform.  £100,000 salary and impressive benefits package including the chance to gain highly sought after Microsoft  Certifications and generous holiday allowance.  5 years+ Dynamics AX experience  C++ and X++ fluency  3 rd Line support and troubleshooting experience  Experience with a Microsoft Gold Partner or End-User  Strong analysis skills  Ambitious and driven personality traits  Innovative mind-set  Technical background in Dynamics AX  \nDynamic Ax Solution Architect jobs in Aberdeen\n  \nJobs at Nigel Frank International in Aberdeen\n  "}, {"title": "Business Performance Analyst / SQL Database Developer & Administrator - VR/16667", "location": "Aberdeen", "description": "Reporting to the Group IT Manager, the successful candidate will be expected to design, maintain, support, and enhance business intelligence and reporting, including the data backend.\n  Engaging with the organisation and recommending / delivering modern, best-practice business intelligence and reporting solutions.\n  Maximising the benefit of existing systems and lead the transition from legacy to current technologies.\n  Working collaboratively in a cross-functional team to proactively drive innovation, business growth and use of systems through technology.\n  Contributing to the overall governance, maintenance and development of the ERP system.\n  Performing core database management and reporting frequency-based activities.\n  Designing and implementing a modern and scalable data warehouse, OLAP-based reporting and BI (SSRS / PowerBI).\n  Working with end users to ensure data and reports meet their business needs.\n  Leading the design and implementation of reporting and database systems.\n  Designing and monitoring end-user reporting tools and systems, ensuring reports are accurate and up-to-date.\n  Responsible and accountable for day-to-day database processes and administration (invoices, MRP, overnight processing etc).\n  Contributing to ERP systems administration, including month-end processing and reporting.\n  Contributing to general IT support.\n  A Degree qualification in a relevant IT discipline is essential.\n  A Masters Degree qualification in a relevant IT discipline is desirable.\n  Relevant IT certification is desirable.\n  Expert level experience with MS SQL Server database technologies.\n  Experience with the delivery of database and BI solutions in an ERP environment.\n  Experience with the design, development and maintenance of data warehouses and business reporting solutions.\n  A strong track record of proactively applying expertise and driving strategic business change.\n  Experience with Microsoft SQL Server database development & administration.\n  Experience with T-SQL.\n  Reporting development experience with OLAP and SSRS.\n  Excel / MS-Query / VBA development experience.\n  The role will involve more than SQL Database administration / development so in addition to having excellent skills in this field, the successful candidate will need to have an excellent awareness of the importance of business reporting, integration and analysis in order to drive wider business change.\n  Background in software development.\n  Experience with / exposure to the latest SQL Server e.g. 2017.\n  Experience of working in a DevOps team.\n  Kanban / Agile methodology experience.\n  C# and .NET software development experience.\n  ERP development / integration experience.\n  Experience with the support, maintenance and development of an ERP.\n  Power BI development experience.\n  Business analysis / process design experience.\n  Project management experience.\n  Visual Studio experience.\n  GIT experience.  \nBusiness Performance Analyst jobs in Aberdeen\n  \nJobs at Thorpe Molloy in Aberdeen\n  "}, {"title": "Front End Developer", "location": "Aberdeen", "description": "A detailed understanding of Angular, with knowledge of Angular 2.0 a big positive  Knowledge of how to layout projects and how to build large-scale web applications using Angular  Commercial experience in front-end development with JavaScript and associated technologies, as well as UI implementation in HTML/CSS  Experience working with build and dependency management technologies and how these apply to / integrate with front-end development  Working knowledge of JavaScript testing frameworks such as Karma or Jasmine  Creating solutions by developing, implementing, and maintaining front-end components of web-based applications within an Agile software development environment  Management of the front-end application infrastructure and architecture  Assisting with workload planning and the design of new software solutions  Supporting users by developing documentation and assistance tools  Writing tests and reviewing the work colleagues  \nFront End Developer jobs in Aberdeen\n  \nJobs at Be-IT Resourcing in Aberdeen\n  "}, {"title": "Software Developer", "location": "Aberdeen AB22", "description": "C or C++  C#  Embedded software development  HTML  CSS  PHP  ASP.NET  Database design and administration  Windows XP,7,8,10 and server environments  Microsoft office  Mac OS  SQL  JavaScript  AppleScript  4th Dimension Database and applications  Microcontrollers Us Robotics Venom, Raspberry PI or Arduino  Internet Information Server  Apache webserver  IOS  Android  Computer hardware and repair  Knowledge of Instrumentation, Electronics or Physics.  "}, {"title": "C# Developer", "location": "Aberdeen", "description": ""}, {"title": "Analyst Developer", "location": "Aberdeen", "description": "Further Particulars and Personal Specifications.pdf\n\n(PDF, 516.35kb)\n  \nAnalyst Developer jobs in Aberdeen\n  \nJobs at University of Aberdeen in Aberdeen\n  "}]